#+BEGIN_COMMENT
.. title: pandas数据分析
.. slug: pandasshu-ju-fen-xi
.. date: 2020-04-15 14:56:47 UTC+08:00
.. tags: draft
.. category: 
.. link: 
.. description: 
.. type: text
#+END_COMMENT
{{{TEASER_END}}}
#+begin_src ipython :session pandas_shuju_fenxi    :exports none
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

#+end_src

#+RESULTS:
: # Out[1]:

* object creating

#+BEGIN_SRC ipython :session pandas_shuju_fenxi :exports both :results raw drawer
# 
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s
#+END_SRC

#+RESULTS:
:results:
# Out[3]:
#+BEGIN_EXAMPLE
  0    1.0
  1    3.0
  2    5.0
  3    NaN
  4    6.0
  5    8.0
  dtype: float64
#+END_EXAMPLE
:end:

#+BEGIN_SRC ipython :session pandas_shuju_fenxi :exports both :results raw drawer
dates = pd.date_range('20130101', periods=6)
dates
#+END_SRC

#+RESULTS:
:results:
# Out[4]:
#+BEGIN_EXAMPLE
  DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
  '2013-01-05', '2013-01-06'],
  dtype='datetime64[ns]', freq='D')
#+END_EXAMPLE
:end:

#+BEGIN_SRC ipython :session pandas_shuju_fenxi :exports both :results raw drawer
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df 
#+END_SRC

#+RESULTS:
:results:
# Out[5]:
#+BEGIN_EXAMPLE
  A         B         C         D
  2013-01-01  0.756325  0.687941  0.145270  0.859375
  2013-01-02  0.837360  0.884369 -0.166789 -0.583702
  2013-01-03 -1.456291 -0.281978 -0.623461  0.133064
  2013-01-04  2.623713  0.424198  0.552203 -0.312511
  2013-01-05 -0.844173 -0.177385  0.330639  2.167758
  2013-01-06 -1.797909 -0.548825  1.413064 -0.518467
#+END_EXAMPLE
:end:

#+BEGIN_SRC ipython :session pandas_shuju_fenxi :exports both :results raw drawer

  df2 = pd.DataFrame({'A': 1.,
					  'B': pd.Timestamp('20130102'),
					  'C': pd.Series(1, index=list(range(4)), dtype='float32'),
					  'D': np.array([3] * 4, dtype='int32'),
					  'E': pd.Categorical(["test", "train", "test", "train"]),
					  'F': 'foo'})

  df2
#+END_SRC

#+RESULTS:
:results:
# Out[6]:
#+BEGIN_EXAMPLE
  A          B    C  D      E    F
  0  1.0 2013-01-02  1.0  3   test  foo
  1  1.0 2013-01-02  1.0  3  train  foo
  2  1.0 2013-01-02  1.0  3   test  foo
  3  1.0 2013-01-02  1.0  3  train  foo
#+END_EXAMPLE
:end:
* data view

#+BEGIN_SRC ipython :session pandas_shuju_fenxi  :exports both :results raw drawer
df.head()

#+END_SRC

#+RESULTS:
:results:
# Out[7]:
#+BEGIN_EXAMPLE
  A         B         C         D
  2013-01-01  0.756325  0.687941  0.145270  0.859375
  2013-01-02  0.837360  0.884369 -0.166789 -0.583702
  2013-01-03 -1.456291 -0.281978 -0.623461  0.133064
  2013-01-04  2.623713  0.424198  0.552203 -0.312511
  2013-01-05 -0.844173 -0.177385  0.330639  2.167758
#+END_EXAMPLE
:end:

#+BEGIN_SRC ipython :session  pandas_shuju_fenxi  :exports both :results raw drawer
df.tail(3)
#+END_SRC

#+RESULTS:
:results:
# Out[8]:
#+BEGIN_EXAMPLE
  A         B         C         D
  2013-01-04  2.623713  0.424198  0.552203 -0.312511
  2013-01-05 -0.844173 -0.177385  0.330639  2.167758
  2013-01-06 -1.797909 -0.548825  1.413064 -0.518467
#+END_EXAMPLE
:end:

#+BEGIN_SRC ipython :session pandas_shuju_fenxi :exports both :results raw drawer
df.describe()
#+END_SRC

#+RESULTS:
:results:
# Out[9]:
#+BEGIN_EXAMPLE
  A         B         C         D
  count  6.000000  6.000000  6.000000  6.000000
  mean   0.019837  0.164720  0.275154  0.290919
  std    1.686452  0.580466  0.692007  1.063464
  min   -1.797909 -0.548825 -0.623461 -0.583702
  25%   -1.303262 -0.255830 -0.088775 -0.466978
  50%   -0.043924  0.123406  0.237954 -0.089724
  75%    0.817101  0.622005  0.496812  0.677797
  max    2.623713  0.884369  1.413064  2.167758
#+END_EXAMPLE
:end:


#+BEGIN_SRC ipython :session pandas_shuju_fenxi :exports both :results raw drawer
df.sort_index(axis=1, ascending=False)
#+END_SRC

#+RESULTS:
:results:
# Out[10]:
#+BEGIN_EXAMPLE
  D         C         B         A
  2013-01-01  0.859375  0.145270  0.687941  0.756325
  2013-01-02 -0.583702 -0.166789  0.884369  0.837360
  2013-01-03  0.133064 -0.623461 -0.281978 -1.456291
  2013-01-04 -0.312511  0.552203  0.424198  2.623713
  2013-01-05  2.167758  0.330639 -0.177385 -0.844173
  2013-01-06 -0.518467  1.413064 -0.548825 -1.797909
#+END_EXAMPLE
:end:
#+BEGIN_SRC ipython :session pandas_shuju_fenxi :exports both :results raw drawer

df.sort_values(by='B')
#+END_SRC

#+RESULTS:
:results:
# Out[11]:
#+BEGIN_EXAMPLE
  A         B         C         D
  2013-01-06 -1.797909 -0.548825  1.413064 -0.518467
  2013-01-03 -1.456291 -0.281978 -0.623461  0.133064
  2013-01-05 -0.844173 -0.177385  0.330639  2.167758
  2013-01-04  2.623713  0.424198  0.552203 -0.312511
  2013-01-01  0.756325  0.687941  0.145270  0.859375
  2013-01-02  0.837360  0.884369 -0.166789 -0.583702
#+END_EXAMPLE
:end:
